{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"mood_before_work:0": {"name": "mood_before_work:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "task:0": {"name": "task:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "deadline:0": {"name": "deadline:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "urgency:0": {"name": "urgency:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "importance:0": {"name": "importance:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "work_days:0": {"name": "work_days:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "average_work_hour:0": {"name": "average_work_hour:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "average_rest:0": {"name": "average_rest:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 386}, "total_gangguan:0": {"name": "total_gangguan:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "sleep_average:0": {"name": "sleep_average:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "age:0": {"name": "age:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "age", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "average_rest", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "average_work_hour", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "deadline", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "importance", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "mood_before_work", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "sleep_average", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "task", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "total_gangguan", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "urgency", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "work_days", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14", "op": "NoOp", "input": ["^age", "^average_rest", "^work_days", "^unknown", "^average_work_hour", "^deadline", "^importance", "^mood_before_work", "^sleep_average", "^task", "^total_gangguan", "^urgency"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["age", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["average_rest", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_9", "op": "Cast", "input": ["average_work_hour", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_4", "op": "Cast", "input": ["deadline", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_5", "op": "Cast", "input": ["importance", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_3", "op": "Cast", "input": ["mood_before_work", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_6", "op": "Cast", "input": ["sleep_average", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["task", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_8", "op": "Cast", "input": ["total_gangguan", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_7", "op": "Cast", "input": ["urgency", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_10", "op": "Cast", "input": ["work_days", "^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_2", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_9", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_4", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_5", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_3", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_6", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_1", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_8", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_7", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/PartitionedCall/Cast_10"], "attr": {"N": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "axis": {"i": "1"}}}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/stack", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "4"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "645", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"container": {"s": ""}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzAyMmRjOGI0LTcxNzAtNDc5Mi04NjdmLTQxMzExNmNiNTY1N19sb2FkXzE="}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^645", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["645", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"rewrite": {"s": ""}, "replace_global": {"b": true}, "pattern": {"s": "NzNmYWNiNTlmNjVkNDJlMGRvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"file_prefix": {"s": "NzNmYWNiNTlmNjVkNDJlMA=="}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1766}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 386}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_591/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "645", "shape": [], "dtype": "string"}]}]}